#### 🏗️ Infrastructure Terraform Plan

**Status:** `success`

<details><summary>📋 Show Plan</summary>

```terraform
aws_ecr_repository.orders: Refreshing state... [id=tech-challenge-orders]
aws_cloudwatch_log_group.payments_service: Refreshing state... [id=/tech-challenge/payments-service]
aws_cloudwatch_log_group.eks_cluster: Refreshing state... [id=/aws/eks/tech-challenge-cluster/cluster]
data.aws_caller_identity.current: Reading...
aws_cloudwatch_metric_alarm.high_cpu: Refreshing state... [id=tech-challenge-high-cpu]
data.aws_iam_role.lab_role: Reading...
aws_cloudwatch_dashboard.main: Refreshing state... [id=TechChallenge-Dashboard]
aws_vpc.main: Refreshing state... [id=vpc-028a6e5c7dd948da2]
aws_cloudwatch_metric_alarm.high_memory: Refreshing state... [id=tech-challenge-high-memory]
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_eAJCZr0PD]
data.aws_caller_identity.current: Read complete after 0s [id=708967422583]
aws_cloudwatch_log_group.applications: Refreshing state... [id=/tech-challenge/applications]
aws_cloudwatch_log_group.orders_service: Refreshing state... [id=/tech-challenge/orders-service]
aws_ecr_repository.customer: Refreshing state... [id=tech-challenge-customer]
aws_cloudwatch_log_group.customer_service: Refreshing state... [id=/tech-challenge/customer-service]
data.aws_iam_role.lab_role: Read complete after 1s [id=LabRole]
aws_ecr_repository.payments: Refreshing state... [id=tech-challenge-payments]
aws_ecr_lifecycle_policy.customer: Refreshing state... [id=tech-challenge-customer]
aws_ecr_lifecycle_policy.orders: Refreshing state... [id=tech-challenge-orders]
aws_ecr_lifecycle_policy.payments: Refreshing state... [id=tech-challenge-payments]
aws_cognito_user_pool_domain.main: Refreshing state... [id=tech-challenge-708967422583]
aws_cognito_user_pool_client.main: Refreshing state... [id=6lm0kiljg87c78lqmbv7kketgi]
aws_internet_gateway.main: Refreshing state... [id=igw-0a7ea2a0f21ba3506]
aws_lb_target_group.nginx_ingress: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323]
aws_security_group.nlb: Refreshing state... [id=sg-04ad870cb1d4a4f2b]
aws_subnet.private[0]: Refreshing state... [id=subnet-08366bdf946d78c00]
aws_subnet.public[0]: Refreshing state... [id=subnet-00807de4031c033f5]
aws_subnet.public[1]: Refreshing state... [id=subnet-0566f2e72b1eef32c]
aws_security_group.eks_cluster: Refreshing state... [id=sg-09b0d67d439566271]
aws_subnet.private[1]: Refreshing state... [id=subnet-04bccc45cc63dbaa9]
aws_eip.nat: Refreshing state... [id=eipalloc-0a46c0c51b068e8e9]
aws_route_table.public: Refreshing state... [id=rtb-07fcdf59c787945e8]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:loadbalancer/net/tech-challenge-nlb/32d2260d89dcae2d]
aws_eks_cluster.main: Refreshing state... [id=tech-challenge-cluster]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4f74b9605ac0801]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f53a15fc1f96e92c]
aws_nat_gateway.main: Refreshing state... [id=nat-018e1e03ff1a81b70]
aws_route_table.private: Refreshing state... [id=rtb-07f695cb9033cbdc5]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:listener/net/tech-challenge-nlb/32d2260d89dcae2d/a6b0710c99a1eb3b]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01b204a242d9b6dbc]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08f937d6323fed744]
aws_eks_node_group.main: Refreshing state... [id=tech-challenge-cluster:tech-challenge-node-group]
kubernetes_namespace.ingress_nginx: Refreshing state... [id=ingress-nginx]
kubernetes_ingress_class.nginx: Refreshing state... [id=nginx]
kubernetes_cluster_role.ingress_nginx: Refreshing state... [id=ingress-nginx]
aws_eks_addon.vpc_cni: Refreshing state... [id=tech-challenge-cluster:vpc-cni]
aws_eks_addon.cloudwatch_observability: Refreshing state... [id=tech-challenge-cluster:amazon-cloudwatch-observability]
aws_eks_addon.kube_proxy: Refreshing state... [id=tech-challenge-cluster:kube-proxy]
aws_eks_addon.coredns: Refreshing state... [id=tech-challenge-cluster:coredns]
kubernetes_service_account.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_config_map.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_service.ingress_nginx_controller: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_role.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_cluster_role_binding.ingress_nginx: Refreshing state... [id=ingress-nginx]
kubernetes_role_binding.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_deployment.ingress_nginx_controller: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_ingress_v1.tech_challenge will be created
  + resource "kubernetes_ingress_v1" "tech_challenge" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"                = "nginx"
              + "nginx.ingress.kubernetes.io/rewrite-target" = "/api$1"
              + "nginx.ingress.kubernetes.io/ssl-redirect"   = "false"
            }
          + generation       = (known after apply)
          + name             = "tech-challenge-ingress"
          + namespace        = "tech-challenge"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + http {
                  + path {
                      + path      = "/api/health"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "orders"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/categories"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "orders"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/products"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "orders"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/orders"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "orders"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/webhooks"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "orders"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/customers"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "customer"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/payments"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "payments"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_namespace.tech_challenge will be created
  + resource "kubernetes_namespace" "tech_challenge" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "environment" = "production"
              + "managed-by"  = "terraform"
              + "name"        = "tech-challenge"
              + "repo"        = "tech-challenge-infra"
            }
          + name             = "tech-challenge"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + namespace_ready               = true

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

---
*Triggered by: @TheMyFish via `pull_request`*